In [1]:
import numpy as np
import pandas as pd

# series

In [3]:
myDict = {"Burak" : 50, "zeynep":40, "mehmet":30}

In [4]:
pd.Series(myDict) #myDict'i bir seriye atadik.

Burak     50
zeynep    40
mehmet    30
dtype: int64

In [6]:
myAge = [50,40,30]
myNames = ["Burak", "zeynep", "mehmet"]

In [7]:
pd.Series(myAge)

0    50
1    40
2    30
dtype: int64

In [8]:
pd.Series(myAge, myNames)

Burak     50
zeynep    40
mehmet    30
dtype: int64

In [9]:
pd.Series(data=myAge, index=myNames)

Burak     50
zeynep    40
mehmet    30
dtype: int64

In [10]:
numpyAr = np.array([50,40,30])
numpyAr

array([50, 40, 30])

In [11]:
pd.Series(numpyAr)

0    50
1    40
2    30
dtype: int32

In [12]:
type(pd.Series(numpyAr))

pandas.core.series.Series

In [13]:
pd.Series(numpyAr, myNames)

Burak     50
zeynep    40
mehmet    30
dtype: int32

In [14]:
pd.Series(["burak","mehmet","osman"], [1,2,3])

1     burak
2    mehmet
3     osman
dtype: object

In [15]:
yarismasonuc1 = pd.Series([10,5,1], ["burak","mehmet","osman"])

In [16]:
yarismasonuc1

burak     10
mehmet     5
osman      1
dtype: int64

In [17]:
yarismasonuc2 = pd.Series([20,10,8],["burak","mehmet","osman"])

In [18]:
yarismasonuc2

burak     20
mehmet    10
osman      8
dtype: int64

In [19]:
yarismasonuc2["mehmet"]

10

In [20]:
sonSonuc = yarismasonuc1 + yarismasonuc2

In [21]:
sonSonuc

burak     30
mehmet    15
osman      9
dtype: int64

In [22]:
farkliSeri = pd.Series([20,30,40,50],["a","b","c","d"])

In [23]:
farkliSeri2 = pd.Series([10,5,3,1,],["a","c","f","g"])

In [24]:
farkliSeri + farkliSeri2 #kesisenleri toplayip getirir.

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

In [30]:
data = np.random.randn(3,3)
data

array([[-0.64245547,  0.41431344, -1.03747688],
       [ 1.02686235,  0.50827169,  0.45701445],
       [-0.01412899, -1.13029831,  0.22197884]])

In [31]:
dataF = pd.DataFrame(data)

In [32]:
dataF

          0         1         2
0 -0.642455  0.414313 -1.037477
1  1.026862  0.508272  0.457014
2 -0.014129 -1.130298  0.221979

In [29]:
type(dataF)

pandas.core.frame.DataFrame

In [33]:
dataF[0]

0   -0.642455
1    1.026862
2   -0.014129
Name: 0, dtype: float64

In [34]:
type(dataF[0])

pandas.core.series.Series

In [35]:
newdataf = pd.DataFrame(data, index=["burak","mehmet","osman"], columns = ["maas", "yas","calismasaat"])

In [36]:
newdataf

            maas       yas  calismasaat
burak  -0.642455  0.414313    -1.037477
mehmet  1.026862  0.508272     0.457014
osman  -0.014129 -1.130298     0.221979

In [37]:
newdataf["yas"]

burak     0.414313
mehmet    0.508272
osman    -1.130298
Name: yas, dtype: float64

In [38]:
newdataf["maas"]

burak    -0.642455
mehmet    1.026862
osman    -0.014129
Name: maas, dtype: float64

In [41]:
newdataf.loc["burak"] #indexi getirmek icin loc kullanilir.

maas          -0.642455
yas            0.414313
calismasaat   -1.037477
Name: burak, dtype: float64

In [42]:
newdataf.iloc[0]

maas          -0.642455
yas            0.414313
calismasaat   -1.037477
Name: burak, dtype: float64

In [43]:
newdataf["emeklilikyas"] = newdataf["yas"] + newdataf["yas"]

In [44]:
newdataf

            maas       yas  calismasaat  emeklilikyas
burak  -0.642455  0.414313    -1.037477      0.828627
mehmet  1.026862  0.508272     0.457014      1.016543
osman  -0.014129 -1.130298     0.221979     -2.260597

In [46]:
newdataf.drop("emeklilikyas", axis = 1) #axis1 sutun olur.

            maas       yas  calismasaat
burak  -0.642455  0.414313    -1.037477
mehmet  1.026862  0.508272     0.457014
osman  -0.014129 -1.130298     0.221979

In [47]:
newdataf.drop("osman", axis=0)

            maas       yas  calismasaat  emeklilikyas
burak  -0.642455  0.414313    -1.037477      0.828627
mehmet  1.026862  0.508272     0.457014      1.016543

In [48]:
newdataf

            maas       yas  calismasaat  emeklilikyas
burak  -0.642455  0.414313    -1.037477      0.828627
mehmet  1.026862  0.508272     0.457014      1.016543
osman  -0.014129 -1.130298     0.221979     -2.260597

In [49]:
newdataf.drop("emeklilikyas", axis=1, inplace=True) #inplace burada degisikligi kalici yaptirir.

In [50]:
newdataf

            maas       yas  calismasaat
burak  -0.642455  0.414313    -1.037477
mehmet  1.026862  0.508272     0.457014
osman  -0.014129 -1.130298     0.221979

In [51]:
booleanFrame = newdataf < 0

In [52]:
newdataf[booleanFrame] #sadece 0'dan kucuk olan degerleri gosterir.

            maas       yas  calismasaat
burak  -0.642455       NaN    -1.037477
mehmet       NaN       NaN          NaN
osman  -0.014129 -1.130298          NaN

In [53]:
newdataf.reset_index()

    index      maas       yas  calismasaat
0   burak -0.642455  0.414313    -1.037477
1  mehmet  1.026862  0.508272     0.457014
2   osman -0.014129 -1.130298     0.221979

In [54]:
newdataf

            maas       yas  calismasaat
burak  -0.642455  0.414313    -1.037477
mehmet  1.026862  0.508272     0.457014
osman  -0.014129 -1.130298     0.221979

In [57]:
newIndex = ["at","zey","hob"]

In [58]:
newdataf["new"] = newIndex

In [59]:
newdataf

            maas       yas  calismasaat  new
burak  -0.642455  0.414313    -1.037477   at
mehmet  1.026862  0.508272     0.457014  zey
osman  -0.014129 -1.130298     0.221979  hob

In [65]:
newdataf.set_index("new", inplace=True)

In [66]:
newdataf

         maas       yas  calismasaat
new
at  -0.642455  0.414313    -1.037477
zey  1.026862  0.508272     0.457014
hob -0.014129 -1.130298     0.221979

In [2]:
dictV = {"Istanbul": [30,29,np.nan], "Ankara": [20,np.nan,25], "Izmir": [40,39,38]}
weatherDF = pd.DataFrame(dictV)

In [3]:
weatherDF

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [9]:
weatherDF.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [10]:
weatherDF

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [11]:
weatherDF.dropna(axis = 1)

   Izmir
0     40
1     39
2     38

In [12]:
newdictV = {"Istanbul": [30,29,np.nan], "Ankara": [20,np.nan,25], "Izmir": [40,39,38], "Bursa": [35,np.nan,np.nan]}
newweatherDF = pd.DataFrame(newdictV)

In [13]:
newdictV

{'Istanbul': [30, 29, nan],
 'Ankara': [20, nan, 25],
 'Izmir': [40, 39, 38],
 'Bursa': [35, nan, nan]}

In [14]:
newweatherDF

   Istanbul  Ankara  Izmir  Bursa
0      30.0    20.0     40   35.0
1      29.0     NaN     39    NaN
2       NaN    25.0     38    NaN

In [15]:
newweatherDF.dropna(axis=1, thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [16]:
newweatherDF.fillna(20)

   Istanbul  Ankara  Izmir  Bursa
0      30.0    20.0     40   35.0
1      29.0    20.0     39   20.0
2      20.0    25.0     38   20.0

# GroupBY

In [24]:
salaryDict = {"Departman": ["Yazlm","Yazlm", "Pazarlama","Pazarlama","Hukuk","Hukuk"],
             "Calsan Ismi": ["Ahmet","Mehmet","Burak","Cengiz","Zeynep","Fatma"],
             "Maas": [100,150,200,300,400,500]
             }

In [25]:
salaryDF = pd.DataFrame(salaryDict)
salaryDF

   Departman Calsan Ismi  Maas
0    Yazlm        Ahmet   100
1    Yazlm       Mehmet   150
2  Pazarlama        Burak   200
3  Pazarlama       Cengiz   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [27]:
groupObj = salaryDF.groupby("Departman")

In [28]:
groupObj.count()

           Calsan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazlm               2     2

In [29]:
groupObj.mean()

           Maas
Departman
Hukuk       450
Pazarlama   250
Yazlm     125

In [30]:
groupObj.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazlm     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

In [37]:
dict1 = {"Isim": ["Ahmet","Mehmet","Zeynep","Burak"],
        "Spor": ["Kosu","Yuzme","Kosu","Basketbol"],
        "Kalori": [100,200,300,400]
        }

In [38]:
dataFrame1 = pd.DataFrame(dict1, index = [0,1,2,3])

In [33]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     300
3   Burak  Basketbol     400

In [39]:
dict2 = {"Isim": ["Osman","Levent","Atlas","Fatma"],
        "Spor": ["Kosu","Yuzme","Kosu","Basketbol"],
        "Kalori": [140,600,400,350]
        }

In [40]:
dataFrame2 = pd.DataFrame(dict2, index = [4,5,6,7])

In [41]:
dict3 = {"Isim": ["Ayse","Mahmut","Duygu","Nur"],
        "Spor": ["Kosu","Yuzme","Badminton","Tenis"],
        "Kalori": [250,670,460,340]
        }

In [42]:
dataFrame3 = pd.DataFrame(dict2, index = [4,5,6,7])

## concatenation

In [43]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     300
3   Burak  Basketbol     400
4   Osman       Kosu     140
5  Levent      Yuzme     600
6   Atlas       Kosu     400
7   Fatma  Basketbol     350
4   Osman       Kosu     140
5  Levent      Yuzme     600
6   Atlas       Kosu     400
7   Fatma  Basketbol     350

## Merge

In [47]:
mergeDict1 = {"Isim": ["Ahmet","Mehmet","Zeynep","Burak"],
             "Spor": ["Kosu","Yuzme","Kosu","Basketbol"]}

In [48]:
mergeDF1 = pd.DataFrame(mergeDict1)

In [49]:
mergeDict2 = {"Isim": ["Ahmet","Mehmet","Zeynep","Burak"],
             "Kalori": [100,200,150,250]}

In [50]:
mergeDF2 = pd.DataFrame(mergeDict2)

In [51]:
pd.merge(mergeDF1,mergeDF2, on="Isim") #isimle eslesmis sekilde birlestirme yaptik.

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     150
3   Burak  Basketbol     250

In [52]:
salaryDict = {"Isim": ["Burak","Zeynep","Mehmet","Ahmet"],
             "Departman": ["Yazilim", "Satis", "Pazarlama", "Yazilim"],
              "Maas": [100,200,300,400]
             }

In [53]:
salaryDF = pd.DataFrame(salaryDict)

In [54]:
salaryDF

     Isim  Departman  Maas
0   Burak    Yazilim   100
1  Zeynep      Satis   200
2  Mehmet  Pazarlama   300
3   Ahmet    Yazilim   400

In [55]:
salaryDF["Departman"].unique()

array(['Yazilim', 'Satis', 'Pazarlama'], dtype=object)

In [57]:
salaryDF["Departman"].nunique()

3

In [58]:
salaryDF["Departman"].value_counts()

Yazilim      2
Satis        1
Pazarlama    1
Name: Departman, dtype: int64

In [61]:
def bruttenNet(maas):
    return maas*0.66

In [63]:
salaryDF["Maas"].apply(bruttenNet)

0     66.0
1    132.0
2    198.0
3    264.0
Name: Maas, dtype: float64

In [65]:
salaryDF.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [78]:
newData = {"Karakter": ["South Park", "South Park", "Simpson", "Simpson","Simpson"],
          "Karakter Ismi:" : ["Cartman", "Kenny","Homer","Bart","Bart"],
          "Karakter Yas" : [9,10,50,20, 10]}

In [79]:
karakterDF = pd.DataFrame(newData)
karakterDF

     Karakter Karakter Ismi:  Karakter Yas
0  South Park        Cartman             9
1  South Park          Kenny            10
2     Simpson          Homer            50
3     Simpson           Bart            20
4     Simpson           Bart            10

In [84]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter", "Karakter Ismi:"],aggfunc=np.sum) #burada np sum olayi onceden Bart'i ortalama aldirirken simdi toplatmis olduk.

                           Karakter Yas
Karakter   Karakter Ismi:
Simpson    Bart                      30
           Homer                     50
South Park Cartman                    9
           Kenny                     10

# Pandas Excel

In [86]:
dataFrame = pd.read_excel("maas.xlsx") #excel dosyasinin ayni lokasyonda olmasi lazim, yoksa okuyamaz.

In [87]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0      Burak   100  40.0    Yazilim
1     Zeynep   150  50.0      satis
2     mehmet   200  30.0        NaN
3      ahmet    50  10.0  pazarlama
4      atlas   150   NaN     finans
5      fatma   200  25.0      hukuk

In [89]:
doludegerlerDF = dataFrame.dropna()

In [90]:
doludegerlerDF

  Unnamed: 0  Maas   Yas  Departman
0      Burak   100  40.0    Yazilim
1     Zeynep   150  50.0      satis
3      ahmet    50  10.0  pazarlama
5      fatma   200  25.0      hukuk

In [91]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0      Burak   100  40.0    Yazilim
1     Zeynep   150  50.0      satis
2     mehmet   200  30.0        NaN
3      ahmet    50  10.0  pazarlama
4      atlas   150   NaN     finans
5      fatma   200  25.0      hukuk

In [93]:
doludegerlerDF.to_excel("yeni_maas.xlsx") #bu da olusturdugumuz yeni df'i yeni bir excel olarak kendi lokasyonuna kaydeder.

In [ ]:
#read_csv
#to_csv